{
  "new_comment": "New Comment",
  "create_account": "Wanna create an account?",
  "register": "Register",
  "create_account_description": "Do you want to sign up and get updates (new posts, replies, LeetCode goodies) while also editing, replying, or nuking your comments—kinda like cleaning up Homer’s donut mess?",
  "yes": "Yes",
  "no": "No",
  "A Fullstack Engineer": "A Fullstack Engineer",
  "A Code Learner": "A Code Learner",
  "A Tech Explorer": "A Tech Explorer",
  "A Digital Craftsman": "A Digital Craftsman",
  "A System Dreamer": "A System Dreamer",
  "welcoming": "Hello, I'm Bao",
  "profile_description": "with a passion for knowledge and creativity, like Homer searching for a donut.",
  "go_to_comment_section": "Go to Comment",
  "about_me": "About me",
  "about_me_description_1": "I’m a programmer with ",
  "8_years": "8 years of experience ",
  "about_me_description_2": "in learning and working with code, ",
  "2_years": "2 years of hands-on experience ",
  "about_me_description_3": "in web development, mobile app development, database design, system architecture, and deployment. ",
  "about_me_description_4": "I have a deep passion for knowledge — especially in programming and technology — which has always been the driving force behind my dedication to every project I take on.",
  "education": "Education",
  "careers": "Careers",
  "collapse": "Collapse",
  "Tien Giang High School for Gifted": "Tien Giang High School for Gifted",
  "Information Technology Major": "(Information Technology Major)",
  "12 years of excellent student": "12 years of excellent student",
  "history": "History",
  "highschool_description": " This is a public high school located in the former Tien Giang Province (now Dong Thap Province). Officially established in 1995, the school has been a leading institution in the province, the Mekong Delta region, and even the entire southern region of Vietnam in terms of both educational quality and student union activities.",
  "source": "Source",
  "achievements": "Achievements",
  "highschool_achievement": " It was at this school that I was first introduced to programming and where I learned the majority of my foundational algorithms — including graph theory, pathfinding, dynamic programming, searching, and more. This solid groundwork equipped me with strong problem-solving skills in programming, as well as the ability to think creatively when approaching complex challenges. During my time at the school, I actively participated in numerous programming competitions and was honored with various awards and medals. Notable achievements among others include:",
  "A silver medal at the Southern Summer Camp": "A silver medal at the Southern Summer Camp (IT field)",
  "First prize in the City-Level Innovation Contest": "First prize in the City-Level Innovation Contest",
  "Third prize in provincial competition for excellent students in information technology (Specialized schools)": "Third prize in provincial competition for excellent students in information technology (Specialized schools)",
  "University of Science VNU - HCM": "University of Science - Vietnam National University",
  "High-Quality Information Technology": "High-Quality Information Technology",
  "Specializing in Software Engineering": "(Specializing in Software Engineering)",
  "university_1": "High scores in core programming subjects (mostly above 8/10).",
  "university_2": "Strong performance in project management, soft skills, and the final internship program.",
  "university_3": "Maintained a GPA of 7.79/10, despite being pulled down by compulsory general education courses (philosophy, law, economics, physics…).",
  "university_4": "Graduation thesis received the highest score (9.4/10) in the graduation evaluation period.",
  "university_description_1": " This university is a leading institution in Southern Vietnam for education, scientific research, technology, and applied sciences. It is a member of the Vietnam National University, Ho Chi Minh City and is recognized as one of the country's key national universities.",
  "university_description_2": "The university ranks 4th in Ho Chi Minh City and 7th nationwide for engeering teaching quality.",
  "university_achievement_1": " One of the first questions that may arise when looking at my academic record is why my overall GPA is only at a “good” level rather than “excellent,” especially given my strong foundation in programming from high school. And it’s a fair question.",
  "university_achievement_2": "While I entered university with solid programming skills, I found myself challenged by several general education subjects such as philosophy, physics, economics, and law — areas that are not my strengths. At my university, however, these subjects are mandatory components of the curriculum. As a result, my grades in these courses were often just enough to pass (typically around 5 or 6 out of 10), which significantly affected my overall GPA.",
  "university_achievement_3": "That said, I take great pride in my performance in all programming-related courses, where I consistently scored above 8. Additionally, I achieved high marks in project management, soft skills, and my internship evaluation. These strong performances helped bring my overall GPA up to 7.79.",
  "university_achievement_4": "What I’m most proud of during my four years at university is that my graduation thesis received the highest score (9.4/10) among all student projects that year. More importantly, university was where I honed my abilities and learned how to apply my knowledge to real-world problems — enabling me to create the best possible products I could deliver.",
  "feature_project": "Feature Project",
  "summarize": "Summarize",
  "more_detail": "More Details",
  "used_frameworks": "Used Frameworks",
  "used_languages": "Used Languages",
  "contacts": "Contacts",
  "comments_title": "What people say about me...",
  "careers": "Careers",
  "game_plugin_developer": "Game Plugin Developer",
  "independent_work": "Indenpendent Work",
  "plugin_1": "Built and managed multiple game servers",
  "plugin_2": "Developed community mods and plugins",
  "plugin_3": "Gained first hands-on experience with Linux and Docker for server deployment and management",
  "plugin_description": "During this period, alongside my studies, I began experimenting with personal projects such as setting up and managing game servers, while also creating mods and plugins for various games. Through these projects, I gradually gained foundational experience in deploying, operating, and developing server systems. This was also the time I first discovered Linux, and I was quickly fascinated by its flexibility and powerful potential for growth. Some of the game servers I built are still running today, and below is a representative plugin I developed and published on the workshop.",
  "description": "Description",
  "cloudgo_1": "Built a comprehensive application ecosystem, including super apps, sub-apps, and mini apps, to deliver a seamless and convenient user experience",
  "cloudgo_2": "Developed and refined multi-channel chat solutions and a customized CRM system tailored to business needs, while handling complex API integrations with external partners",
  "cloudgo_3": "Emphasized performance optimization and scalability, ensuring that the platform remains stable, flexible, and future-ready.",
  "cloudgo_achievement_1": "Developed super app platform and 3 sub-apps (CloudSales – full-stack & DevOps, CloudOCS – full-stack & DevOps, CloudWork – frontend)",
  "cloudgo_achievement_2": "Built and optimized multi-channel chatbox (Facebook, Zalo, …) with scalable backend and responsive web interface",
  "cloudgo_achievement_3": "Managed API license approval & integration processes with Facebook and Zalo",
  "cloudgo_achievement_4": "Developed Zalo Mini App to collect customer feedback, issue reports, and responses",
  "cloudgo_achievement_5": "Designed and deployed a high-load message relay system, processing 100–200 msgs/min for 20+ CRM systems with low-latency deliver",
  "cloudgo_achievement_6": "Contributed to the CRM Suggestion Module, improving idea, report, and document workflows",
  "cloudgo_description_1": "During my time at CloudGo, I had the opportunity to be deeply involved in the development and deployment of several key company products. I directly contributed to building the super app platform – the central foundation for developing and integrating sub-applications. From this platform, I worked on three major apps: CloudSales, a sales solution where I handled the entire process from frontend and backend to DevOps; CloudOCS, a multi-channel sales application (Shopee, TikTok Shop, …) where I was responsible for the full development lifecycle; and CloudWork, a task management application where I focused on frontend development.",
  "cloudgo_description_2": "In addition, I built and optimized a multi-channel chatbox, designing a scalable backend for message processing, enhancing performance, and developing an intuitive web interface. I also managed the API licensing process and app administration with Facebook and Zalo, ensuring compliance with their strict requirements. Furthermore, I developed a Zalo Mini App dedicated to collecting feedback, handling issue reports, and providing quick responses to customer inquiries.",
  "cloudgo_description_3": "One of the projects I took special ownership of was designing, deploying, and maintaining a high-load message relay system, capable of reliably processing and forwarding 100–200 messages per minute across more than 20 CRM systems with low latency. In parallel, I contributed to the development of the CRM Suggestion Module, helping optimize workflows for managing ideas, documents, and reports within the company.",
  "freelancer_1": "Realized the importance of a personalized workspace to maximize productivity.",
  "freelancer_2": "Optimized configs for Neovim, Tmux, Sketchybar, Homerow, and keyboard layouts → fully mouse-free workflow.",
  "freelancer_3": "Built and completed most features of this portfolio website within 1 month thanks to the optimized setup.",
  "freelancer_description": "Throughout my work, I realized that having a stable and highly personalized workspace plays a crucial role in optimizing both productivity and speed. With this in mind, I decided to focus on tailoring and refining my own work environment. During this period, I optimized my setup with Neovim, Tmux, Sketchybar, Homerow, and custom keyboard layouts to build a workflow entirely free from mouse dependency, saving time and maximizing efficiency. At the same time, I completed this portfolio website, and thanks to the optimized configurations, I was able to implement most of its features within just one month.",
  "Comment Editing": "Comment Editing",
  "Comment Deleting": "Comment Deleting",
  "Input new content": "Input new content",
  "New content is required": "New content is required",
  "Do you realy want to delete your comment?": "Do you realy want to delete your comment?",
  "Reply Comment": "Reply Comment"
}
