{
  "new_comment": "Thêm bình luận",
  "create_account": "Tạo tài khoản mới không bạn?",
  "register": "Đăng kí",
  "create_account_description": "Bạn có muốn đăng kí và nhận những cập nhật mới nhất (như bài viết, bình luận trả lời, bài giải LeetCode,...) cũng như là chỉnh sửa, trả lời, xóa bình luận của bạn như dọn đống donut của Homer không?",
  "yes": "Có",
  "no": "Không",
  "A Fullstack Engineer": "Kĩ sư phần mềm A-Z",
  "A Code Learner": "Người học code",
  "A Tech Explorer": "Người khám phá công nghệ",
  "A Digital Craftsman": "Thợ thủ công kĩ thuật số",
  "A System Dreamer": "Người mơ về các hệ thống",
  "welcoming": "Chào, Bảo đây",
  "profile_description": "với đam mê mãnh liệt về kiến thức và sự sáng tạo như Homer tìm kiếm những cái donuts cho mình.",
  "go_to_comment_section": "Mục bình luận",
  "about_me": "Thông tin",
  "about_me_description_1": "Mình là một lập trình viên với ",
  "8_years": "8 năm kinh nghiệm ",
  "about_me_description_2": "trong việc học tập và làm việc với code, ",
  "2_years": "2 năm kinh nghiệm thực tế ",
  "about_me_description_3": "trong phát triển web, mobile app, thiết kế cơ sở dữ liệu, kiến trúc, triển khai và quản lí hệ thống. ",
  "about_me_description_4": "Mình có một niềm đam mê mãnh liệt với kiến thức - đặc biệt là trong lập trình và công nghệ - Và đây luôn là động lực thúc đẩy phía sau sự tận tâm và nổ lực của mình trong mỗi dự án mà mình tham gia.",
  "education": "Giáo dục",
  "careers": "Sự nghiệp",
  "collapse": "Thu gọn",
  "Tien Giang High School for Gifted": "Trường Trung học phổ thông Chuyên Tiền Giang",
  "Information Technology Major": "(Chuyên tin 17-20)",
  "12 years of excellent student": "12 năm học sinh giỏi",
  "history": "Lịch sử",
  "highschool_description": " Đây là một trường cấp 3 công lập tọa lạc tại tỉnh Tiền Giang xưa (nay là tỉnh Đồng Tháp). Được chính thức thành lập năm 1995, trường đã và đang là một trong những trường dẫn đầu về cả chất lượng giảng dạy, giáo dục và các hoạt động đoàn đội của tỉnh và đồng bằng sông Cửu Long nói riêng, cũng như cả khu vực miền Nam nói chung",
  "source": "Nguồn",
  "achievements": "Thành tựu",
  "highschool_achievement": " Đây là nơi đầu tiên mình được làm quen với lập trình và cũng là nơi mình học được hầu hết các thuật toán nền tảng mà mình sử dụng sau này - bao gồm các lí thuyết đồ thị, thuật toán tìm đường, quy hoạch động, tìm kiếm, cây nhị phân, và nhiều hơn nữa. Đây là nền tảng vững chắc đã giúp mình có được kĩ năng giải quyết vấn đề trong lập trình, cũng như là khả năng suy nghĩ sáng tạo khi gặp phải những thử thách khó khăn. Trong thời gian học tập tại trường, mình đã tham gia một số cuộc thi lập trình và cũng vinh dự nhận được một số các giải thưởng cũng như là huy chương. Một số thành tựu giải thưởng tiêu biểu bao gồm:",
  "A silver medal at the Southern Summer Camp": "Huy chương bạc trại hè Phương Nam (khối chuyên tin)",
  "First prize in the City-Level Innovation Contest": "Giải nhất cuộc thi sáng tạo trẻ cấp thành phố",
  "Third prize in provincial competition for excellent students in information technology (Specialized schools)": "Giải ba cuộc thi học sinh giỏi cấp tỉnh (Khối trường chuyên)",
  "University of Science VNU - HCM": "Trường Đại học Khoa học Tự nhiên VNU - HCM",
  "High-Quality Information Technology": "Chương trình CNTT chất lượng cao",
  "Specializing in Software Engineering": "(Chuyên ngành Kỹ sư phần mềm)",
  "university_1": "Điểm cao ở các môn chuyên ngành lập trình (đa số >8/10).",
  "university_2": "Kết quả tốt ở các môn quản lý dự án, kỹ năng mềm và kỳ thực tập cuối khóa.",
  "university_3": "Duy trì GPA 7.79/10, dù bị kéo xuống bởi các môn đại cương bắt buộc (triết, luật, kinh tế, vật lý…).",
  "university_4": "Khóa luận tốt nghiệp đạt điểm cao nhất trong kì xét tốt nghiệp (9.4/10).",
  "university_description_1": " Đây là một trong những trường đại học dẫn đầu khu vực miền nam Việt Nam về chất lượng trong giảng dạy, nghiên cứu khoa học, công nghệ và ứng dụng khoa học trong thực tiễn. Đây là thành viên của Đại học Quốc gia thành phố Hồ Chí Minh (được biết đến là một trong những đại học trọng điểm của quốc gia).",
  "university_description_2": "Là trường đại học đứng thứ 4 tại thành phố Hồ Chí Minh và thứ 7 trên cả nước về chất lượng giảng dạy các ngành kĩ thuật.",
  "university_achievement_1": " Một trong những câu hỏi đầu tiên khi nhìn vào điểm tổng kết đại học của mình là tại sao GPA chỉ ở mức khá mà không phải là mức giỏi, đặt biệt là với nền tảng vững chắc về lập trình mà mình đã có được từ khi học ở cấp 3. Đây là một câu hỏi khá hợp lí.",
  "university_achievement_2": "Khi mình vào đại học với nền tảng kiến thức của mình, mình đã gặp khá nhiều khó khăn trong các môn học đại cương như triết học, vật lí, kinh tế, luật - đây không phải là điểm mạnh của mình. Tuy nhiên đây lại là những môn học bắt buộc ở đại học. Và kết quả là những môn học này mình chỉ vừa đủ điểm để vừa qua được (thông thường là 5-6/10), đây là các nhân tố chính ảnh hưởng đến GPA tổng kết của mình.",
  "university_achievement_3": "Tuy nhiên, mình khá tự hào về kết quả của những môn học về lập trình mà mình đã được học, phần lớn tất cả đều trên 8 với chỉ duy nhất 1 lần học đầu tiên. Thêm nữa, mình cũng đạt được điểm khá cao trong các môn quản lí dự án, kĩ năng mềm, cũng như là kì thực tập tốt nghiệp của mình. Những điểm mạnh này đã giúp mình đạt được GPA 7.79 dù những điểm số tệ trước đó.",
  "university_achievement_4": "Điều mà mình tự hào nhất trong bốn năm đại học là luận văn tốt nghiệp của mình đạt điểm cao nhất (9,4/10) trong số tất cả các đồ án của sinh viên năm đó. Quan trọng hơn, đại học là nơi mình đã có thể rèn giũa năng lực học và tự học để áp dụng kiến thức vào các vấn đề thực tế — cho phép mình tạo ra những sản phẩm tốt nhất có thể.",
  "feature_project": "Dự án nổi bật",
  "summarize": "Tổng kết",
  "more_detail": "Chi tiết hơn",
  "used_frameworks": "Các Frameworks đã sử dụng",
  "used_languages": "Các ngôn ngữ đã sử dụng",
  "contacts": "Liên hệ",
  "comments_title": "Mọi người nói gì về mình...",
  "careers": "Sự nghiệp",
  "Game_plugin_developer": "Game Plugin Developer",
  "independent_work": "Indenpendent Work",
  "plugin_1": "Xây dựng và quản lí một số server game",
  "plugin_2": "Phát triển một số mods và plugin cho cộng đồng",
  "plugin_3": "Có được kinh nghiệm thực tế đầu tiên với Linux và Docker để triển khai và quản lý server",
  "plugin_description": "Trong giai đoạn này, bên cạnh việc học tập ở trường, mình đã bắt đầu thử sức với các dự án cá nhân như mở và quản lý server game, đồng thời viết một số mod và plugin cho trò chơi. Qua đó, mình dần nắm được những bước cơ bản trong việc triển khai, vận hành và phát triển hệ thống server. Đây cũng là thời điểm mình bắt đầu tiếp xúc với Linux và nhanh chóng bị cuốn hút bởi sự linh hoạt và tiềm năng phát triển mạnh mẽ của nó. Một số server game mình xây dựng vẫn còn hoạt động cho đến hiện tại, và dưới đây là một plugin tiêu biểu mà mình đã phát triển và chia sẻ trên workshop.",
  "description": "Mô tả",
  "cloudgo_1": "Phát triển hệ sinh thái ứng dụng, bao gồm siêu ứng dụng, các ứng dụng con và mini app, nhằm mang đến trải nghiệm đồng bộ và tiện ích cho người dùng",
  "cloudgo_2": "Triển khai và hoàn thiện các giải pháp chat đa kênh, hệ thống CRM tùy chỉnh theo nhu cầu doanh nghiệp, cũng như xử lý các tích hợp API phức tạp với đối tác bên ngoài",
  "cloudgo_3": "Chú trọng tối ưu hiệu năng và khả năng mở rộng của hệ thống, đảm bảo nền tảng ổn định, linh hoạt và sẵn sàng cho tương lai",
  "cloudgo_achievement_1": "Phát triển nền tảng siêu ứng dụng và 3 ứng dụng con (CloudSales – full-stack & DevOps, CloudOCS – full-stack & DevOps, CloudWork – frontend)",
  "cloudgo_achievement_2": "Xây dựng và tối ưu hóa Chatbox đa kênh (Facebook, Zalo, …) với backend có khả năng mở rộng và giao diện web thân thiện",
  "cloudgo_achievement_3": "Quản lý quy trình xin cấp phép & tích hợp API với Facebook và Zalo",
  "cloudgo_achievement_4": "Phát triển Zalo Mini App để thu thập phản hồi khách hàng, báo lỗi và phản hồi thông tin",
  "cloudgo_achievement_5": "Thiết kế và triển khai hệ thống chuyển tiếp tin nhắn tải cao, xử lý 100–200 tin nhắn/phút cho hơn 20 hệ thống CRM với khả năng phản hồi nhanh và ổn định",
  "cloudgo_achievement_6": "Đóng góp vào Module Đề Xuất trong CRM, cải thiện quy trình đề xuất ý tưởng, báo cáo và tài liệu",
  "cloudgo_description_1": "Trong thời gian làm việc tại CloudGo, mình có cơ hội tham gia sâu vào quá trình phát triển và triển khai nhiều sản phẩm quan trọng của công ty. Mình trực tiếp góp phần xây dựng siêu ứng dụng – nền tảng trung tâm cho phép phát triển và tích hợp các ứng dụng con. Từ nền tảng này, mình tham gia phát triển ba ứng dụng chính: CloudSales – giải pháp bán hàng mà mình đảm nhận toàn bộ quy trình từ frontend, backend cho đến DevOps; CloudOCS – ứng dụng hỗ trợ bán hàng đa kênh (Shopee, TikTok Shop, …) với vai trò full-stack, phụ trách toàn bộ vòng đời phát triển; và CloudWork – ứng dụng quản lý công việc mà mình tập trung vào phần frontend.",
  "cloudgo_description_2": "Bên cạnh đó, mình xây dựng và tối ưu Chatbox đa kênh, bao gồm thiết kế backend xử lý tin nhắn với khả năng mở rộng, tối ưu hóa hiệu năng, đồng thời phát triển giao diện trực quan cho nền tảng web. Mình cũng trực tiếp tham gia quy trình xin giấy phép API và quản lý ứng dụng trên Facebook và Zalo, đảm bảo sản phẩm đáp ứng các yêu cầu nghiêm ngặt từ phía các nền tảng lớn. Ngoài ra, mình phát triển Zalo Mini App nhằm hỗ trợ việc thu thập phản hồi, tiếp nhận báo lỗi và cung cấp phản hồi nhanh chóng cho khách hàng.",
  "cloudgo_description_3": "Một trong những dự án mình đặc biệt chú trọng là việc thiết kế, triển khai và duy trì hệ thống xử lý và chuyển tiếp tin nhắn tải cao, có khả năng chuyển tiếp ổn định 100–200 tin nhắn mỗi phút cho hơn 20 hệ thống CRM khác nhau. Song song đó, mình còn tham gia phát triển Module Đề Xuất trong CRM, góp phần tối ưu hóa quy trình quản lý ý tưởng, tài liệu và báo cáo trong nội bộ doanh nghiệp.",
  "freelancer_1": "Nhận ra tầm quan trọng của một workspace cá nhân hóa để tối ưu hiệu suất.",
  "freelancer_2": "Tối ưu config cho Neovim, Tmux, Sketchybar, Homerow, bố cục bàn phím → loại bỏ hoàn toàn sử dụng chuột.",
  "freelancer_3": "Hoàn thiện website portfolio với hầu hết tính năng chỉ trong 1 tháng nhờ workflow được tối ưu.",
  "freelancer_description": "Trong quá trình làm việc, mình nhận ra rằng một không gian làm việc ổn định và được cá nhân hóa cao đóng vai trò quan trọng trong việc tối ưu hiệu suất và tốc độ xử lý công việc. Vì vậy, mình quyết định tập trung vào việc xây dựng và tinh chỉnh môi trường làm việc cá nhân. Trong giai đoạn này, mình đã tối ưu cấu hình cho Neovim, Tmux, Sketchybar, Homerow và cả bố cục bàn phím, nhằm tạo ra một môi trường làm việc hoàn toàn không phụ thuộc vào chuột, giúp tiết kiệm thời gian và nâng cao hiệu quả. Song song đó, mình cũng hoàn thiện website portfolio này, và nhờ những cấu hình được tối ưu hóa, mình đã có thể hoàn thành phần lớn tính năng của trang chỉ trong vòng một tháng."
}
